mehdinuri/CPU4v1/CPM/CP/App/Adapters/STM32/MmiCanAdapter.c
/* App/Adapters/STM32/MmiCanAdapter.c */
#include "MmiCanAdapter.h"

#include <string.h>

#include "stm32h7xx_hal.h"

#define MMI_CAN_ADAPTER_RX_DEPTH 16U
#define MMI_CAN_ADAPTER_TX_DEPTH 32U
#define MMI_CAN_ADAPTER_TRANSFER_BUFFER_BYTES 512U
#define MMI_CAN_ADAPTER_CONTROLLER_ROLE_CP 1U

static const uint32_t kDbCreateTransactionOid[] =
{
  1U, 3U, 6U, 1U, 4U, 1U, 1206U, 4U, 2U, 6U, 2U, 1U, 0U
};
static const uint32_t kDbTransactionIdOid[] =
{
  1U, 3U, 6U, 1U, 4U, 1U, 1206U, 4U, 2U, 6U, 2U, 4U, 0U
};

typedef struct
{
  uint16_t standardId;
  uint8_t length;
  uint8_t data[8];
} MmiQueuedFrame_t;

static MmiCanAdapterCtx_t *s_registeredCtx = NULL;

static uint32_t ReadLe32(const uint8_t *bytes)
{
  return (uint32_t) ((uint32_t) bytes[0]
                     | ((uint32_t) bytes[1] << 8U)
                     | ((uint32_t) bytes[2] << 16U)
                     | ((uint32_t) bytes[3] << 24U));
}

static void WriteLe32(uint8_t *bytes, uint32_t value)
{
  bytes[0] = (uint8_t) (value & 0xFFU);
  bytes[1] = (uint8_t) ((value >> 8U) & 0xFFU);
  bytes[2] = (uint8_t) ((value >> 16U) & 0xFFU);
  bytes[3] = (uint8_t) ((value >> 24U) & 0xFFU);
}

static uint8_t DlcToLength(uint32_t dlc)
{
  switch (dlc)
  {
      case FDCAN_DLC_BYTES_0: return 0U;
      case FDCAN_DLC_BYTES_1: return 1U;
      case FDCAN_DLC_BYTES_2: return 2U;
      case FDCAN_DLC_BYTES_3: return 3U;
      case FDCAN_DLC_BYTES_4: return 4U;
      case FDCAN_DLC_BYTES_5: return 5U;
      case FDCAN_DLC_BYTES_6: return 6U;
      case FDCAN_DLC_BYTES_7: return 7U;
      case FDCAN_DLC_BYTES_8: return 8U;
      default: return 8U;
  }
}

static uint32_t LengthToDlc(uint8_t length)
{
  switch (length)
  {
      case 0U: return FDCAN_DLC_BYTES_0;
      case 1U: return FDCAN_DLC_BYTES_1;
      case 2U: return FDCAN_DLC_BYTES_2;
      case 3U: return FDCAN_DLC_BYTES_3;
      case 4U: return FDCAN_DLC_BYTES_4;
      case 5U: return FDCAN_DLC_BYTES_5;
      case 6U: return FDCAN_DLC_BYTES_6;
      case 7U: return FDCAN_DLC_BYTES_7;
      case 8U:
      default:
      {
        return FDCAN_DLC_BYTES_8;
      }
  }
}

static void CreateOsObjects(MmiCanAdapterCtx_t *ctx)
{
  if (ctx == NULL)
  {
    return;
  }

  if (ctx->rxPool == NULL)
  {
    ctx->rxPool = osMemoryPoolNew(MMI_CAN_ADAPTER_RX_DEPTH,
                                  sizeof(MmiQueuedFrame_t),
                                  NULL);
  }

  if (ctx->txPool == NULL)
  {
    ctx->txPool = osMemoryPoolNew(MMI_CAN_ADAPTER_TX_DEPTH,
                                  sizeof(MmiQueuedFrame_t),
                                  NULL);
  }

  if (ctx->rxQueue == NULL)
  {
    ctx->rxQueue = osMessageQueueNew(MMI_CAN_ADAPTER_RX_DEPTH,
                                     sizeof(MmiQueuedFrame_t *),
                                     NULL);
  }

  if (ctx->txQueue == NULL)
  {
    ctx->txQueue = osMessageQueueNew(MMI_CAN_ADAPTER_TX_DEPTH,
                                     sizeof(MmiQueuedFrame_t *),
                                     NULL);
  }
}

static uint8_t QueueFrame(osMemoryPoolId_t pool,
                          osMessageQueueId_t queue,
                          uint16_t standardId,
                          const uint8_t *data,
                          uint8_t length)
{
  MmiQueuedFrame_t *queuedFrame;

  if ((pool == NULL) || (queue == NULL) || (data == NULL) || (length > 8U))
  {
    return 0U;
  }

  queuedFrame = (MmiQueuedFrame_t *) osMemoryPoolAlloc(pool, 0U);
  if (queuedFrame == NULL)
  {
    return 0U;
  }

  (void) memset(queuedFrame, 0, sizeof(*queuedFrame));
  queuedFrame->standardId = standardId;
  queuedFrame->length = length;
  (void) memcpy(&queuedFrame->data[0], data, length);

  if (osMessageQueuePut(queue, &queuedFrame, 0U, 0U) != osOK)
  {
    (void) osMemoryPoolFree(pool, queuedFrame);
    return 0U;
  }

  return 1U;
}

static uint8_t QueueTxFrame(MmiCanAdapterCtx_t *ctx,
                            uint16_t standardId,
                            const uint8_t *data,
                            uint8_t length)
{
  if ((ctx == NULL) || (QueueFrame(ctx->txPool,
                                   ctx->txQueue,
                                   standardId,
                                   data,
                                   length) == 0U))
  {
    if (ctx != NULL)
    {
      ctx->txDrops++;
    }
    return 0U;
  }

  return 1U;
}

static void ResetRxTransfer(MmiCanAdapterCtx_t *ctx)
{
  if (ctx == NULL)
  {
    return;
  }

  ctx->rxActive = 0U;
  ctx->rxMessageClass = MMI_PROTOCOL_V2_MESSAGE_CLASS_NONE;
  ctx->rxSessionId = 0U;
  ctx->rxTransferId = 0U;
  ctx->rxNextSegmentIndex = 0U;
  ctx->rxExpectedLength = 0U;
  (void) memset(&ctx->rxBuffer[0], 0, sizeof(ctx->rxBuffer));
}

static uint8_t QueueAck(MmiCanAdapterCtx_t *ctx,
                        MmiProtocolMessageClass_t messageClass,
                        uint8_t transferId,
                        MmiProtocolStatus_t status)
{
  MmiProtocolAckV2_t ack;

  (void) memset(&ack, 0, sizeof(ack));
  ack.messageClass = (uint8_t) messageClass;
  ack.transferId = transferId;
  ack.status = (uint8_t) status;

  return QueueTxFrame(ctx,
                      MMI_PROTOCOL_V2_CAN_ID_ACK,
                      (const uint8_t *) &ack,
                      (uint8_t) sizeof(ack));
}

static uint8_t QueueHelloResponse(MmiCanAdapterCtx_t *ctx,
                                  const MmiProtocolHelloRequestV2_t *request)
{
  MmiProtocolHelloResponseV2_t response;
  uint32_t activeGeneration = 0U;

  if ((ctx == NULL) || (request == NULL))
  {
    return 0U;
  }

  ctx->sessionId = (request->requestedSessionId != 0U)
                   ? request->requestedSessionId
                   : 1U;

  (void) memset(&response, 0, sizeof(response));
  response.protocolVersion = MMI_PROTOCOL_V2_VERSION;
  response.controllerRole = MMI_CAN_ADAPTER_CONTROLLER_ROLE_CP;
  response.capabilityFlags = MMI_PROTOCOL_V2_CAPABILITY_RUNTIME;
  if (ctx->service != NULL)
  {
    response.capabilityFlags |= MMI_PROTOCOL_V2_CAPABILITY_STANDARD_OBJECTS;
  }
  if (ctx->localSettingsService != NULL)
  {
    response.capabilityFlags |= MMI_PROTOCOL_V2_CAPABILITY_LOCAL_SETTINGS;
  }
  if (ctx->eventLogService != NULL)
  {
    response.capabilityFlags |= MMI_PROTOCOL_V2_CAPABILITY_EVENT_LOG;
  }
  response.assignedSessionId = ctx->sessionId;

  if ((ctx->service != NULL) && (ctx->service->configurationService != NULL))
  {
    response.activeConfigSetId = ConfigurationServiceGetActiveSetId(
      ctx->service->configurationService);
    activeGeneration = ConfigurationServiceGetActiveGeneration(
      ctx->service->configurationService);
    response.activeGenerationLow = (uint16_t) (activeGeneration & 0xFFFFU);
  }

