mehdinuri/CPU4v1/CPM/CP/App/Adapters/STM32/MmiCanAdapter.c
  if ((ctx->service != NULL) && (ctx->service->cpMpLinkService != NULL))
  {
    response.authorityReady = CpMpLinkServiceAuthorityReady(
      ctx->service->cpMpLinkService);
    response.peerHealthy = CpMpLinkServicePeerHealthy(
      ctx->service->cpMpLinkService);
  }

  return QueueTxFrame(ctx,
                      MMI_PROTOCOL_V2_CAN_ID_HELLO_RSP,
                      (const uint8_t *) &response,
                      (uint8_t) sizeof(response));
}

static uint8_t QueueSegmentedTransfer(MmiCanAdapterCtx_t *ctx,
                                      uint16_t standardId,
                                      uint8_t sessionId,
                                      uint8_t transferId,
                                      const uint8_t *payload,
                                      uint16_t payloadLength)
{
  MmiProtocolSegmentV2_t segment;
  uint16_t offset = 0U;
  uint8_t segmentIndex = 0U;
  uint8_t bytesToCopy;

  if ((ctx == NULL) || ((payload == NULL) && (payloadLength != 0U)))
  {
    return 0U;
  }

  do
  {
    (void) memset(&segment, 0, sizeof(segment));
    segment.sessionId = sessionId;
    segment.transferId = transferId;
    segment.segmentIndex = segmentIndex;
    segment.flags = 0U;
    if (segmentIndex == 0U)
    {
      segment.flags |= MMI_PROTOCOL_V2_SEGMENT_FLAG_FIRST;
    }

    if ((payloadLength - offset) > MMI_PROTOCOL_V2_SEGMENT_DATA_BYTES)
    {
      bytesToCopy = MMI_PROTOCOL_V2_SEGMENT_DATA_BYTES;
    }
    else
    {
      bytesToCopy = (uint8_t) (payloadLength - offset);
      segment.flags |= MMI_PROTOCOL_V2_SEGMENT_FLAG_LAST;
    }

    if ((bytesToCopy > 0U) && (payload != NULL))
    {
      (void) memcpy(&segment.bytes[0], &payload[offset], bytesToCopy);
    }

    if (QueueTxFrame(ctx,
                     standardId,
                     (const uint8_t *) &segment,
                     (uint8_t) sizeof(segment)) == 0U)
    {
      return 0U;
    }

    offset = (uint16_t) (offset + bytesToCopy);
    segmentIndex++;
  } while (offset < payloadLength);

  if (payloadLength == 0U)
  {
    (void) memset(&segment, 0, sizeof(segment));
    segment.sessionId = sessionId;
    segment.transferId = transferId;
    segment.segmentIndex = 0U;
    segment.flags = (uint8_t) (MMI_PROTOCOL_V2_SEGMENT_FLAG_FIRST
                               | MMI_PROTOCOL_V2_SEGMENT_FLAG_LAST);
    return QueueTxFrame(ctx,
                        standardId,
                        (const uint8_t *) &segment,
                        (uint8_t) sizeof(segment));
  }

  return 1U;
}

static uint8_t QueueCommandResponse(MmiCanAdapterCtx_t *ctx,
                                    const MmiProtocolCommandHeaderV2_t *request,
                                    MmiProtocolStatus_t status,
                                    const uint8_t *payload,
                                    uint16_t payloadLength)
{
  MmiProtocolResponseHeaderV2_t responseHeader;
  uint8_t transfer[MMI_CAN_ADAPTER_TRANSFER_BUFFER_BYTES];
  uint16_t totalLength;

  if ((ctx == NULL) || (request == NULL))
  {
    return 0U;
  }

  totalLength = (uint16_t) (sizeof(responseHeader) + payloadLength);
  if (totalLength > sizeof(transfer))
  {
    status = MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR;
    payload = NULL;
    payloadLength = 0U;
    totalLength = (uint16_t) sizeof(responseHeader);
  }

  responseHeader.opcode = request->opcode;
  responseHeader.namespaceId = request->namespaceId;
  responseHeader.resourceId = request->resourceId;
  responseHeader.recordIndex = request->recordIndex;
  responseHeader.transactionId = request->transactionId;
  responseHeader.status = (uint8_t) status;
  responseHeader.payloadLength = payloadLength;

  (void) memset(&transfer[0], 0, sizeof(transfer));
  (void) memcpy(&transfer[0], &responseHeader, sizeof(responseHeader));
  if ((payloadLength > 0U) && (payload != NULL))
  {
    (void) memcpy(&transfer[sizeof(responseHeader)], payload, payloadLength);
  }

  return QueueSegmentedTransfer(ctx,
                                MMI_PROTOCOL_V2_CAN_ID_RESPONSE_SEG,
                                ctx->sessionId,
                                ctx->rxTransferId,
                                &transfer[0],
                                totalLength);
}

static MmiProtocolStatus_t MapNtcipError(NtcipError_t error)
{
  switch (error)
  {
      case NTCIP_ERROR_OK:
      {
        return MMI_PROTOCOL_V2_STATUS_OK;
      }

      case NTCIP_ERROR_NOT_FOUND:
      {
        return MMI_PROTOCOL_V2_STATUS_NOT_FOUND;
      }

      case NTCIP_ERROR_READ_ONLY:
      {
        return MMI_PROTOCOL_V2_STATUS_NOT_WRITABLE;
      }

      case NTCIP_ERROR_NO_ACCESS:
      {
        return MMI_PROTOCOL_V2_STATUS_BUSY;
      }

      case NTCIP_ERROR_BAD_VALUE:
      case NTCIP_ERROR_RANGE_ERROR:
      {
        return MMI_PROTOCOL_V2_STATUS_INVALID_VALUE;
      }

      case NTCIP_ERROR_NO_TRANSACTION:
      case NTCIP_ERROR_OWNER_MISMATCH:
      case NTCIP_ERROR_TRANSACTION_ID_MISMATCH:
      {
        return MMI_PROTOCOL_V2_STATUS_TRANSACTION_REQUIRED;
      }

      case NTCIP_ERROR_GEN_ERROR:
      case NTCIP_ERROR_COMMIT_FAILED:
      default:
      {
        return MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR;
      }
  }
}

static uint16_t StandardObjectPayloadMinLength(void)
{
  return (uint16_t) sizeof(MmiProtocolObjectPrefixV2_t);
}

static uint8_t DecodeNtcipValue(const MmiProtocolObjectPrefixV2_t *prefix,
                                const uint8_t *encodedValue,
                                NtcipValue_t *value)
{
  uint8_t index;

  if ((prefix == NULL) || (value == NULL)
      || ((prefix->valueLength != 0U) && (encodedValue == NULL)))
  {
    return 0U;
  }

  switch ((NtcipValueType_t) prefix->valueEncoding)
  {
      case NTCIP_VALUE_TYPE_UNSIGNED32:
      {
        if (prefix->valueLength != 4U)
        {
          return 0U;
        }

        NtcipValueSetUnsigned32(value, ReadLe32(encodedValue));
        return 1U;
      }

      case NTCIP_VALUE_TYPE_SIGNED32:
      {
        if (prefix->valueLength != 4U)
        {
          return 0U;
        }

        NtcipValueSetSigned32(value, (int32_t) ReadLe32(encodedValue));
        return 1U;
      }

      case NTCIP_VALUE_TYPE_OBJECT_ID:
      {
        uint32_t oid[NTCIP_OID_MAX_LENGTH];

