mehdinuri/CPU4v1/CPM/CP/App/Adapters/STM32/MmiCanAdapter.c
        if (((prefix->valueLength % 4U) != 0U)
            || ((prefix->valueLength / 4U) > NTCIP_OID_MAX_LENGTH))
        {
          return 0U;
        }

        for (index = 0U; index < (prefix->valueLength / 4U); index++)
        {
          oid[index] = ReadLe32(&encodedValue[(uint16_t) index * 4U]);
        }

        return (uint8_t) (NtcipValueSetObjectId(value,
                                                &oid[0],
                                                (uint8_t) (prefix->valueLength
                                                           / 4U))
                          == NTCIP_ERROR_OK);
      }

      case NTCIP_VALUE_TYPE_OCTET_STRING:
      {
        return (uint8_t) (NtcipValueSetOctetString(value,
                                                   encodedValue,
                                                   prefix->valueLength)
                          == NTCIP_ERROR_OK);
      }

      default:
      {
        return 0U;
      }
  }
}

static uint8_t EncodeNtcipValue(const NtcipValue_t *value,
                                uint8_t *encodedValue,
                                uint16_t *encodedLength,
                                uint8_t *encoding)
{
  uint8_t index;

  if ((value == NULL) || (encodedLength == NULL) || (encoding == NULL))
  {
    return 0U;
  }

  *encodedLength = 0U;
  *encoding = (uint8_t) value->type;

  switch (value->type)
  {
      case NTCIP_VALUE_TYPE_UNSIGNED32:
      {
        if (encodedValue == NULL)
        {
          return 0U;
        }

        WriteLe32(encodedValue, value->data.unsigned32);
        *encodedLength = 4U;
        return 1U;
      }

      case NTCIP_VALUE_TYPE_SIGNED32:
      {
        if (encodedValue == NULL)
        {
          return 0U;
        }

        WriteLe32(encodedValue, (uint32_t) value->data.signed32);
        *encodedLength = 4U;
        return 1U;
      }

      case NTCIP_VALUE_TYPE_OBJECT_ID:
      {
        if ((encodedValue == NULL)
            || (((uint16_t) value->data.objectId.length * 4U)
                > MMI_CAN_ADAPTER_TRANSFER_BUFFER_BYTES))
        {
          return 0U;
        }

        for (index = 0U; index < value->data.objectId.length; index++)
        {
          WriteLe32(&encodedValue[(uint16_t) index * 4U],
                    value->data.objectId.elements[index]);
        }

        *encodedLength = (uint16_t) value->data.objectId.length * 4U;
        return 1U;
      }

      case NTCIP_VALUE_TYPE_OCTET_STRING:
      {
        if ((encodedValue == NULL)
            || (value->data.octetString.length > MMI_CAN_ADAPTER_TRANSFER_BUFFER_BYTES))
        {
          return 0U;
        }

        if (value->data.octetString.length > 0U)
        {
          (void) memcpy(encodedValue,
                        &value->data.octetString.bytes[0],
                        value->data.octetString.length);
        }

        *encodedLength = value->data.octetString.length;
        return 1U;
      }

      default:
      {
        return 0U;
      }
  }
}

static uint8_t ParseStandardObjectPayload(const uint8_t *payload,
                                          uint16_t payloadLength,
                                          MmiProtocolObjectPrefixV2_t *prefix,
                                          uint32_t *oid,
                                          uint8_t *oidLength,
                                          const uint8_t **valueBytes)
{
  uint16_t minimumLength;
  uint16_t oidBytesLength;

  if ((payload == NULL) || (prefix == NULL) || (oid == NULL)
      || (oidLength == NULL) || (valueBytes == NULL))
  {
    return 0U;
  }

  minimumLength = StandardObjectPayloadMinLength();
  if (payloadLength < minimumLength)
  {
    return 0U;
  }

  (void) memcpy(prefix, payload, sizeof(*prefix));
  if (prefix->oidLength > NTCIP_OID_MAX_LENGTH)
  {
    return 0U;
  }

  oidBytesLength = (uint16_t) prefix->oidLength * 4U;
  if (payloadLength != (uint16_t) (minimumLength
                                   + oidBytesLength
                                   + prefix->valueLength))
  {
    return 0U;
  }

  for (*oidLength = 0U; *oidLength < prefix->oidLength; (*oidLength)++)
  {
    oid[*oidLength] = ReadLe32(&payload[minimumLength
                                        + ((uint16_t) *oidLength * 4U)]);
  }

  *valueBytes = &payload[minimumLength + oidBytesLength];
  return 1U;
}

static uint8_t BuildStandardObjectPayload(const uint32_t *oid,
                                          uint8_t oidLength,
                                          const NtcipValue_t *value,
                                          uint8_t *payload,
                                          uint16_t *payloadLength)
{
  MmiProtocolObjectPrefixV2_t prefix;
  uint16_t offset;
  uint16_t valueLength;
  uint8_t valueEncoding;
  uint8_t encodedValue[MMI_CAN_ADAPTER_TRANSFER_BUFFER_BYTES];
  uint8_t index;

  if ((oid == NULL) || (value == NULL) || (payload == NULL)
      || (payloadLength == NULL) || (oidLength > NTCIP_OID_MAX_LENGTH))
  {
    return 0U;
  }

  if (EncodeNtcipValue(value,
                       &encodedValue[0],
                       &valueLength,
                       &valueEncoding) == 0U)
  {
    return 0U;
  }

  offset = StandardObjectPayloadMinLength();
  if ((uint16_t) (offset + ((uint16_t) oidLength * 4U) + valueLength)
      > MMI_CAN_ADAPTER_TRANSFER_BUFFER_BYTES)
  {
    return 0U;
  }

  prefix.oidLength = oidLength;
  prefix.valueEncoding = valueEncoding;
  prefix.valueLength = valueLength;
  (void) memcpy(payload, &prefix, sizeof(prefix));

  for (index = 0U; index < oidLength; index++)
  {
    WriteLe32(&payload[offset + ((uint16_t) index * 4U)], oid[index]);
  }

  offset = (uint16_t) (offset + ((uint16_t) oidLength * 4U));
  if (valueLength > 0U)
  {
    (void) memcpy(&payload[offset], &encodedValue[0], valueLength);
  }

  *payloadLength = (uint16_t) (offset + valueLength);
  return 1U;
}

static void BuildRequestContext(MmiCanAdapterCtx_t *ctx,
                                uint8_t transactionId,
                                NtcipRequestContext_t *requestContext)
{
  if ((ctx == NULL) || (requestContext == NULL))
  {
    return;
  }

  LWIPSNMPAdapterBuildRequestContext(&ctx->ntcipAdapter,
                                     ctx->sessionId,
                                     requestContext);

