mehdinuri/CPU4v1/CPM/CP/App/Adapters/STM32/MmiCanAdapter.c
  if (transactionId != 0U)
  {
    requestContext->transactionIdValid = 1U;
    requestContext->transactionId = transactionId;
  }
}

static MmiProtocolStatus_t StandardTransactionControl(
  MmiCanAdapterCtx_t *ctx,
  MmiProtocolOpcode_t opcode,
  uint8_t transactionId)
{
  NtcipRequestContext_t requestContext;
  NtcipValue_t value;
  NtcipError_t error;

  if ((ctx == NULL) || (transactionId == 0U))
  {
    return MMI_PROTOCOL_V2_STATUS_INVALID_VALUE;
  }

  BuildRequestContext(ctx, transactionId, &requestContext);

  switch (opcode)
  {
      case MMI_PROTOCOL_V2_OPCODE_BEGIN_TRANSACTION:
      {
        NtcipValueSetUnsigned32(&value,
                                (uint32_t) NTCIP_DB_CREATE_STATE_TRANSACTION);
        error = LWIPSNMPAdapterSetValue(&ctx->ntcipAdapter,
                                        &kDbCreateTransactionOid[0],
                                        13U,
                                        &requestContext,
                                        &value);
        if (error != NTCIP_ERROR_OK)
        {
          return MapNtcipError(error);
        }

        NtcipValueSetUnsigned32(&value, transactionId);
        error = LWIPSNMPAdapterSetValue(&ctx->ntcipAdapter,
                                        &kDbTransactionIdOid[0],
                                        13U,
                                        &requestContext,
                                        &value);
        return MapNtcipError(error);
      }

      case MMI_PROTOCOL_V2_OPCODE_VERIFY:
      {
        NtcipValueSetUnsigned32(&value, (uint32_t) NTCIP_DB_CREATE_STATE_VERIFY);
        error = LWIPSNMPAdapterSetValue(&ctx->ntcipAdapter,
                                        &kDbCreateTransactionOid[0],
                                        13U,
                                        &requestContext,
                                        &value);
        return MapNtcipError(error);
      }

      case MMI_PROTOCOL_V2_OPCODE_COMMIT:
      case MMI_PROTOCOL_V2_OPCODE_ROLLBACK:
      {
        NtcipValueSetUnsigned32(&value, (uint32_t) NTCIP_DB_CREATE_STATE_NORMAL);
        error = LWIPSNMPAdapterSetValue(&ctx->ntcipAdapter,
                                        &kDbCreateTransactionOid[0],
                                        13U,
                                        &requestContext,
                                        &value);
        return MapNtcipError(error);
      }

      default:
      {
        return MMI_PROTOCOL_V2_STATUS_UNSUPPORTED;
      }
  }
}

static MmiProtocolStatus_t HandleStandardObjectCommand(
  MmiCanAdapterCtx_t *ctx,
  const MmiProtocolCommandHeaderV2_t *request,
  const uint8_t *payload,
  uint16_t payloadLength,
  uint8_t *responsePayload,
  uint16_t *responsePayloadLength)
{
  MmiProtocolObjectPrefixV2_t prefix;
  NtcipRequestContext_t requestContext;
  NtcipValue_t value;
  NtcipError_t error;
  uint32_t oid[NTCIP_OID_MAX_LENGTH];
  uint8_t oidLength = 0U;
  const uint8_t *valueBytes = NULL;

  if ((ctx == NULL) || (request == NULL) || (responsePayload == NULL)
      || (responsePayloadLength == NULL))
  {
    return MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR;
  }

  switch ((MmiProtocolOpcode_t) request->opcode)
  {
      case MMI_PROTOCOL_V2_OPCODE_BEGIN_TRANSACTION:
      case MMI_PROTOCOL_V2_OPCODE_VERIFY:
      case MMI_PROTOCOL_V2_OPCODE_COMMIT:
      case MMI_PROTOCOL_V2_OPCODE_ROLLBACK:
      {
        if (payloadLength != 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_INVALID_VALUE;
        }

        return StandardTransactionControl(ctx,
                                          (MmiProtocolOpcode_t) request->opcode,
                                          request->transactionId);
      }

      case MMI_PROTOCOL_V2_OPCODE_GET:
      {
        if (ParseStandardObjectPayload(payload,
                                       payloadLength,
                                       &prefix,
                                       &oid[0],
                                       &oidLength,
                                       &valueBytes) == 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_INVALID_VALUE;
        }

        BuildRequestContext(ctx, request->transactionId, &requestContext);
        error = LWIPSNMPAdapterGet(&ctx->ntcipAdapter,
                                   &oid[0],
                                   oidLength,
                                   &requestContext,
                                   &value);
        if (error != NTCIP_ERROR_OK)
        {
          return MapNtcipError(error);
        }

        if (BuildStandardObjectPayload(&oid[0],
                                       oidLength,
                                       &value,
                                       responsePayload,
                                       responsePayloadLength) == 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR;
        }

        return MMI_PROTOCOL_V2_STATUS_OK;
      }

      case MMI_PROTOCOL_V2_OPCODE_SET:
      {
        if (ParseStandardObjectPayload(payload,
                                       payloadLength,
                                       &prefix,
                                       &oid[0],
                                       &oidLength,
                                       &valueBytes) == 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_INVALID_VALUE;
        }

        if (DecodeNtcipValue(&prefix, valueBytes, &value) == 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_INVALID_VALUE;
        }

        BuildRequestContext(ctx, request->transactionId, &requestContext);
        error = LWIPSNMPAdapterSetTest(&ctx->ntcipAdapter,
                                       &oid[0],
                                       oidLength,
                                       &requestContext,
                                       &value);
        if (error != NTCIP_ERROR_OK)
        {
          return MapNtcipError(error);
        }

        error = LWIPSNMPAdapterSetValue(&ctx->ntcipAdapter,
                                        &oid[0],
                                        oidLength,
                                        &requestContext,
                                        &value);
        return MapNtcipError(error);
      }

      default:
      {
        return MMI_PROTOCOL_V2_STATUS_UNSUPPORTED;
      }
  }
}

