mehdinuri/CPU4v1/CPM/CP/App/Adapters/STM32/MmiCanAdapter.c
static MmiProtocolStatus_t HandleLocalSettingsCommand(
  MmiCanAdapterCtx_t *ctx,
  const MmiProtocolCommandHeaderV2_t *request,
  const uint8_t *payload,
  uint16_t payloadLength,
  uint8_t *responsePayload,
  uint16_t *responsePayloadLength)
{
  if ((ctx == NULL) || (request == NULL) || (responsePayload == NULL)
      || (responsePayloadLength == NULL))
  {
    return MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR;
  }

  if (ctx->localSettingsService == NULL)
  {
    return MMI_PROTOCOL_V2_STATUS_UNSUPPORTED;
  }

  switch ((MmiProtocolOpcode_t) request->opcode)
  {
      case MMI_PROTOCOL_V2_OPCODE_GET:
      {
        if (payloadLength != 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_INVALID_VALUE;
        }

        return MmiLocalSettingsServiceRead(ctx->localSettingsService,
                                           request->resourceId,
                                           responsePayload,
                                           responsePayloadLength);
      }

      case MMI_PROTOCOL_V2_OPCODE_SET:
      {
        return MmiLocalSettingsServiceWrite(ctx->localSettingsService,
                                            request->resourceId,
                                            payload,
                                            payloadLength);
      }

      default:
      {
        return MMI_PROTOCOL_V2_STATUS_UNSUPPORTED;
      }
  }
}

static MmiProtocolStatus_t HandleEventLogCommand(
  MmiCanAdapterCtx_t *ctx,
  const MmiProtocolCommandHeaderV2_t *request,
  const uint8_t *payload,
  uint16_t payloadLength,
  uint8_t *responsePayload,
  uint16_t *responsePayloadLength)
{
  if ((ctx == NULL) || (request == NULL) || (responsePayload == NULL)
      || (responsePayloadLength == NULL))
  {
    return MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR;
  }

  if (ctx->eventLogService == NULL)
  {
    return MMI_PROTOCOL_V2_STATUS_UNSUPPORTED;
  }

  if (request->opcode != MMI_PROTOCOL_V2_OPCODE_GET)
  {
    return MMI_PROTOCOL_V2_STATUS_UNSUPPORTED;
  }

  return MmiEventLogServiceRead(ctx->eventLogService,
                                request->resourceId,
                                payload,
                                payloadLength,
                                responsePayload,
                                MMI_CAN_ADAPTER_TRANSFER_BUFFER_BYTES,
                                responsePayloadLength);
}

static MmiProtocolStatus_t HandleMaintenanceCommand(
  MmiCanAdapterCtx_t *ctx,
  const MmiProtocolCommandHeaderV2_t *request,
  const uint8_t *payload,
  uint16_t payloadLength)
{
  if ((ctx == NULL) || (request == NULL) || (ctx->maintenanceService == NULL))
  {
    return MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR;
  }

  if ((request->opcode != MMI_PROTOCOL_V2_OPCODE_COMMAND)
      && (request->opcode != MMI_PROTOCOL_V2_OPCODE_SET))
  {
    return MMI_PROTOCOL_V2_STATUS_UNSUPPORTED;
  }

  return MmiMaintenanceServiceExecute(ctx->maintenanceService,
                                      request->resourceId,
                                      payload,
                                      payloadLength);
}

static uint8_t IsKnownNamespace(uint8_t namespaceId)
{
  switch (namespaceId)
  {
      case MMI_PROTOCOL_V2_NAMESPACE_RUNTIME:
      case MMI_PROTOCOL_V2_NAMESPACE_STANDARD_OBJECT:
      case MMI_PROTOCOL_V2_NAMESPACE_LOCAL_SETTINGS:
      case MMI_PROTOCOL_V2_NAMESPACE_VENDOR_PRIVATE:
      case MMI_PROTOCOL_V2_NAMESPACE_EVENT_LOG:
      case MMI_PROTOCOL_V2_NAMESPACE_MAINTENANCE:
      {
        return 1U;
      }

      default:
      {
        return 0U;
      }
  }
}

static MmiProtocolStatus_t NormalizeRecordIndex(
  const MmiResourceDescriptor_t *descriptor,
  uint16_t recordCount,
  uint8_t *recordIndex)
{
  if ((descriptor == NULL) || (recordIndex == NULL))
  {
    return MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR;
  }

  if (descriptor->countSource == MMI_RESOURCE_COUNT_SINGLE)
  {
    if ((*recordIndex != 0U) && (*recordIndex != 1U))
    {
      return MMI_PROTOCOL_V2_STATUS_BAD_INDEX;
    }

    *recordIndex = 0U;
    return MMI_PROTOCOL_V2_STATUS_OK;
  }

  if ((*recordIndex == 0U) || ((uint16_t) *recordIndex > recordCount))
  {
    return MMI_PROTOCOL_V2_STATUS_BAD_INDEX;
  }

  return MMI_PROTOCOL_V2_STATUS_OK;
}

static MmiProtocolStatus_t BuildRuntimePayload(
  const MmiProtocolCommandHeaderV2_t *request,
  uint8_t *payload,
  uint16_t *payloadLength,
  const MmiResourceDescriptor_t *descriptor,
  MmiSnapshotCache_t *snapshotCache)
{
  uint8_t recordIndex;

  if ((request == NULL) || (payload == NULL) || (payloadLength == NULL)
      || (descriptor == NULL) || (snapshotCache == NULL))
  {
    return MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR;
  }

  recordIndex = request->recordIndex;

  switch (request->resourceId)
  {
      case MMI_PROTOCOL_V2_RUNTIME_TOPIC_SUMMARY:
      {
        MmiRuntimeSummaryV2_t record;

        if (MmiSnapshotCacheGetSummary(snapshotCache, &record) == 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR;
        }

        *payloadLength = (uint16_t) sizeof(record);
        (void) memcpy(payload, &record, sizeof(record));
        break;
      }

      case MMI_PROTOCOL_V2_RUNTIME_TOPIC_RINGS:
      {
        MmiRuntimeRingRecordV2_t record;

        if (MmiSnapshotCacheGetRingRecord(snapshotCache,
                                          recordIndex,
                                          &record) == 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_NOT_FOUND;
        }

        *payloadLength = (uint16_t) sizeof(record);
        (void) memcpy(payload, &record, sizeof(record));
        break;
      }

      case MMI_PROTOCOL_V2_RUNTIME_TOPIC_PHASES:
      {
        MmiRuntimePhaseRecordV2_t record;

        if (MmiSnapshotCacheGetPhaseRecord(snapshotCache,
                                           recordIndex,
                                           &record) == 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_NOT_FOUND;
        }

        *payloadLength = (uint16_t) sizeof(record);
        (void) memcpy(payload, &record, sizeof(record));
        break;
      }

      case MMI_PROTOCOL_V2_RUNTIME_TOPIC_CHANNELS:
      {
        MmiRuntimeChannelRecordV2_t record;

        if (MmiSnapshotCacheGetChannelRecord(snapshotCache,
                                             recordIndex,
                                             &record) == 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_NOT_FOUND;
        }

        *payloadLength = (uint16_t) sizeof(record);
        (void) memcpy(payload, &record, sizeof(record));
        break;
      }

      case MMI_PROTOCOL_V2_RUNTIME_TOPIC_OVERLAPS:
      {
        MmiRuntimeOverlapRecordV2_t record;

