mehdinuri/CPU4v1/CPM/CP/App/Adapters/STM32/MmiCanAdapter.c
        if (MmiSnapshotCacheGetOverlapRecord(snapshotCache,
                                             recordIndex,
                                             &record) == 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_NOT_FOUND;
        }

        *payloadLength = (uint16_t) sizeof(record);
        (void) memcpy(payload, &record, sizeof(record));
        break;
      }

      case MMI_PROTOCOL_V2_RUNTIME_TOPIC_RAW_INPUTS:
      {
        MmiRuntimeRawInputsV2_t record;

        if (MmiSnapshotCacheGetRawInputs(snapshotCache, &record) == 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR;
        }

        *payloadLength = (uint16_t) sizeof(record);
        (void) memcpy(payload, &record, sizeof(record));
        break;
      }

      case MMI_PROTOCOL_V2_RUNTIME_TOPIC_VEHICLE_DETECTORS:
      {
        MmiRuntimeVehicleDetectorRecordV2_t record;

        if (MmiSnapshotCacheGetVehicleDetectorRecord(snapshotCache,
                                                     recordIndex,
                                                     &record) == 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_NOT_FOUND;
        }

        *payloadLength = (uint16_t) sizeof(record);
        (void) memcpy(payload, &record, sizeof(record));
        break;
      }

      case MMI_PROTOCOL_V2_RUNTIME_TOPIC_PEDESTRIAN_DETECTORS:
      {
        MmiRuntimePedestrianDetectorRecordV2_t record;

        if (MmiSnapshotCacheGetPedestrianDetectorRecord(snapshotCache,
                                                        recordIndex,
                                                        &record) == 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_NOT_FOUND;
        }

        *payloadLength = (uint16_t) sizeof(record);
        (void) memcpy(payload, &record, sizeof(record));
        break;
      }

      case MMI_PROTOCOL_V2_RUNTIME_TOPIC_MODULE_STATUS:
      {
        MmiRuntimeModuleStatusV2_t record;

        if (MmiSnapshotCacheGetModuleStatus(snapshotCache, &record) == 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR;
        }

        *payloadLength = (uint16_t) sizeof(record);
        (void) memcpy(payload, &record, sizeof(record));
        break;
      }

      case MMI_PROTOCOL_V2_RUNTIME_TOPIC_SAFETY_SUMMARY:
      {
        MmiRuntimeSafetySummaryV2_t record;

        if (MmiSnapshotCacheGetSafetySummary(snapshotCache, &record) == 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR;
        }

        *payloadLength = (uint16_t) sizeof(record);
        (void) memcpy(payload, &record, sizeof(record));
        break;
      }

      case MMI_PROTOCOL_V2_RUNTIME_TOPIC_SAFETY_CHANNELS:
      {
        MmiRuntimeSafetyChannelRecordV2_t record;

        if (MmiSnapshotCacheGetSafetyChannelRecord(snapshotCache,
                                                   recordIndex,
                                                   &record) == 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_NOT_FOUND;
        }

        *payloadLength = (uint16_t) sizeof(record);
        (void) memcpy(payload, &record, sizeof(record));
        break;
      }

      case MMI_PROTOCOL_V2_RUNTIME_TOPIC_CLOCK:
      {
        MmiRuntimeClockSummaryV2_t record;

        if (MmiSnapshotCacheGetClockSummary(snapshotCache, &record) == 0U)
        {
          return MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR;
        }

        *payloadLength = (uint16_t) sizeof(record);
        (void) memcpy(payload, &record, sizeof(record));
        break;
      }

      default:
      {
        (void) descriptor;
        return MMI_PROTOCOL_V2_STATUS_UNSUPPORTED;
      }
  }

  return MMI_PROTOCOL_V2_STATUS_OK;
}

static void ProcessCommandTransfer(MmiCanAdapterCtx_t *ctx)
{
  MmiProtocolCommandHeaderV2_t request;
  MmiResourceDescriptor_t descriptor;
  MmiProtocolStatus_t status;
  uint16_t recordCount = 0U;
  uint8_t normalizedIndex;
  uint8_t payload[MMI_CAN_ADAPTER_TRANSFER_BUFFER_BYTES];
  uint16_t payloadLength = 0U;
  const uint8_t *requestPayload;

  if ((ctx == NULL) || (ctx->service == NULL) || (ctx->snapshotCache == NULL))
  {
    ResetRxTransfer(ctx);
    return;
  }

  (void) memset(&request, 0, sizeof(request));
  (void) memcpy(&request, &ctx->rxBuffer[0], sizeof(request));

  if ((uint16_t) (sizeof(request) + request.payloadLength) != ctx->rxExpectedLength)
  {
    (void) QueueCommandResponse(ctx,
                                &request,
                                MMI_PROTOCOL_V2_STATUS_INVALID_VALUE,
                                NULL,
                                0U);
    ResetRxTransfer(ctx);
    return;
  }

  requestPayload = &ctx->rxBuffer[sizeof(request)];

  if (IsKnownNamespace(request.namespaceId) == 0U)
  {
    (void) QueueCommandResponse(ctx,
                                &request,
                                MMI_PROTOCOL_V2_STATUS_BAD_NAMESPACE,
                                NULL,
                                0U);
    ResetRxTransfer(ctx);
    return;
  }

  if (MmiServiceLookupResource(ctx->service,
                               request.namespaceId,
                               request.resourceId,
                               &descriptor) == 0U)
  {
    (void) QueueCommandResponse(ctx,
                                &request,
                                MMI_PROTOCOL_V2_STATUS_BAD_RESOURCE,
                                NULL,
                                0U);
    ResetRxTransfer(ctx);
    return;
  }

  if (request.namespaceId != MMI_PROTOCOL_V2_NAMESPACE_RUNTIME)
  {
    if (request.namespaceId == MMI_PROTOCOL_V2_NAMESPACE_STANDARD_OBJECT)
    {
      status = HandleStandardObjectCommand(ctx,
                                           &request,
                                           requestPayload,
                                           request.payloadLength,
                                           &payload[0],
                                           &payloadLength);
      (void) QueueCommandResponse(ctx,
                                  &request,
                                  status,
                                  &payload[0],
                                  (status == MMI_PROTOCOL_V2_STATUS_OK)
                                  ? payloadLength
                                  : 0U);
      ResetRxTransfer(ctx);
      return;
    }

    if (request.namespaceId == MMI_PROTOCOL_V2_NAMESPACE_LOCAL_SETTINGS)
    {
      if (MmiServiceResolveRecordCount(ctx->service, &descriptor, &recordCount)
          == 0U)
      {
        (void) QueueCommandResponse(ctx,
                                    &request,
                                    MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR,
                                    NULL,
                                    0U);
        ResetRxTransfer(ctx);
        return;
      }

      normalizedIndex = request.recordIndex;
      status = NormalizeRecordIndex(&descriptor, recordCount, &normalizedIndex);
      if (status != MMI_PROTOCOL_V2_STATUS_OK)
      {
        (void) QueueCommandResponse(ctx, &request, status, NULL, 0U);
        ResetRxTransfer(ctx);
        return;
      }

      request.recordIndex = normalizedIndex;
      status = HandleLocalSettingsCommand(ctx,
                                          &request,
                                          requestPayload,
                                          request.payloadLength,
                                          &payload[0],
                                          &payloadLength);
      (void) QueueCommandResponse(ctx,
                                  &request,
                                  status,
                                  &payload[0],
                                  (status == MMI_PROTOCOL_V2_STATUS_OK)
                                  ? payloadLength
                                  : 0U);
      ResetRxTransfer(ctx);
      return;
    }

    if (request.namespaceId == MMI_PROTOCOL_V2_NAMESPACE_EVENT_LOG)
    {
      status = HandleEventLogCommand(ctx,
                                     &request,
                                     requestPayload,
                                     request.payloadLength,
                                     &payload[0],
                                     &payloadLength);
      (void) QueueCommandResponse(ctx,
                                  &request,
                                  status,
                                  &payload[0],
                                  (status == MMI_PROTOCOL_V2_STATUS_OK)
                                  ? payloadLength
                                  : 0U);
      ResetRxTransfer(ctx);
      return;
    }

