mehdinuri/CPU4v1/CPM/CP/App/Adapters/STM32/MmiCanAdapter.c
    if (request.namespaceId == MMI_PROTOCOL_V2_NAMESPACE_MAINTENANCE)
    {
      status = HandleMaintenanceCommand(ctx,
                                        &request,
                                        requestPayload,
                                        request.payloadLength);
      (void) QueueCommandResponse(ctx,
                                  &request,
                                  status,
                                  NULL,
                                  0U);
      ResetRxTransfer(ctx);
      return;
    }

    (void) QueueCommandResponse(ctx,
                                &request,
                                MMI_PROTOCOL_V2_STATUS_UNSUPPORTED,
                                NULL,
                                0U);
    ResetRxTransfer(ctx);
    return;
  }

  if ((request.opcode != MMI_PROTOCOL_V2_OPCODE_GET)
      || (request.payloadLength != 0U))
  {
    (void) QueueCommandResponse(ctx,
                                &request,
                                MMI_PROTOCOL_V2_STATUS_UNSUPPORTED,
                                NULL,
                                0U);
    ResetRxTransfer(ctx);
    return;
  }

  if (MmiServiceResolveRecordCount(ctx->service, &descriptor, &recordCount) == 0U)
  {
    (void) QueueCommandResponse(ctx,
                                &request,
                                MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR,
                                NULL,
                                0U);
    ResetRxTransfer(ctx);
    return;
  }

  normalizedIndex = request.recordIndex;
  status = NormalizeRecordIndex(&descriptor, recordCount, &normalizedIndex);
  if (status != MMI_PROTOCOL_V2_STATUS_OK)
  {
    (void) QueueCommandResponse(ctx, &request, status, NULL, 0U);
    ResetRxTransfer(ctx);
    return;
  }

  request.recordIndex = normalizedIndex;
  payloadLength = 0U;

  status = BuildRuntimePayload(&request,
                               &payload[0],
                               &payloadLength,
                               &descriptor,
                               ctx->snapshotCache);
  (void) QueueCommandResponse(ctx,
                              &request,
                              status,
                              &payload[0],
                              (status == MMI_PROTOCOL_V2_STATUS_OK)
                              ? payloadLength
                              : 0U);
  ResetRxTransfer(ctx);
}

static void ProcessCommandSegment(MmiCanAdapterCtx_t *ctx,
                                  const MmiProtocolSegmentV2_t *segment)
{
  uint16_t offset;
  MmiProtocolCommandHeaderV2_t header;

  if ((ctx == NULL) || (segment == NULL))
  {
    return;
  }

  if (ctx->sessionId == 0U)
  {
    ctx->sessionId = (segment->sessionId != 0U) ? segment->sessionId : 1U;
  }

  if (segment->sessionId != ctx->sessionId)
  {
    (void) QueueAck(ctx,
                    MMI_PROTOCOL_V2_MESSAGE_CLASS_COMMAND,
                    segment->transferId,
                    MMI_PROTOCOL_V2_STATUS_BUSY);
    return;
  }

  if (MmiProtocolV2SegmentIsFirst(segment) != 0U)
  {
    ResetRxTransfer(ctx);
    ctx->rxActive = 1U;
    ctx->rxMessageClass = MMI_PROTOCOL_V2_MESSAGE_CLASS_COMMAND;
    ctx->rxSessionId = segment->sessionId;
    ctx->rxTransferId = segment->transferId;
    ctx->rxNextSegmentIndex = 0U;
  }

  if ((ctx->rxActive == 0U)
      || (ctx->rxTransferId != segment->transferId)
      || (ctx->rxNextSegmentIndex != segment->segmentIndex))
  {
    ResetRxTransfer(ctx);
    (void) QueueAck(ctx,
                    MMI_PROTOCOL_V2_MESSAGE_CLASS_COMMAND,
                    segment->transferId,
                    MMI_PROTOCOL_V2_STATUS_BUSY);
    return;
  }

  offset = (uint16_t) segment->segmentIndex
           * MMI_PROTOCOL_V2_SEGMENT_DATA_BYTES;
  if ((offset + MMI_PROTOCOL_V2_SEGMENT_DATA_BYTES) > sizeof(ctx->rxBuffer))
  {
    ResetRxTransfer(ctx);
    (void) QueueAck(ctx,
                    MMI_PROTOCOL_V2_MESSAGE_CLASS_COMMAND,
                    segment->transferId,
                    MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR);
    return;
  }

  (void) memcpy(&ctx->rxBuffer[offset],
                &segment->bytes[0],
                MMI_PROTOCOL_V2_SEGMENT_DATA_BYTES);
  ctx->rxNextSegmentIndex++;

  if ((ctx->rxExpectedLength == 0U)
      && ((offset + MMI_PROTOCOL_V2_SEGMENT_DATA_BYTES) >= sizeof(header)))
  {
    (void) memcpy(&header, &ctx->rxBuffer[0], sizeof(header));
    ctx->rxExpectedLength = (uint16_t) (sizeof(header) + header.payloadLength);
    if (ctx->rxExpectedLength > sizeof(ctx->rxBuffer))
    {
      ResetRxTransfer(ctx);
      (void) QueueAck(ctx,
                      MMI_PROTOCOL_V2_MESSAGE_CLASS_COMMAND,
                      segment->transferId,
                      MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR);
      return;
    }
  }

  if (MmiProtocolV2SegmentIsLast(segment) != 0U)
  {
    if ((ctx->rxExpectedLength == 0U)
        || (ctx->rxExpectedLength > (offset + MMI_PROTOCOL_V2_SEGMENT_DATA_BYTES)))
    {
      ResetRxTransfer(ctx);
      (void) QueueAck(ctx,
                      MMI_PROTOCOL_V2_MESSAGE_CLASS_COMMAND,
                      segment->transferId,
                      MMI_PROTOCOL_V2_STATUS_INTERNAL_ERROR);
      return;
    }

    ProcessCommandTransfer(ctx);
  }
}

static void ProcessRxFrame(MmiCanAdapterCtx_t *ctx,
                           const MmiQueuedFrame_t *frame)
{
  MmiProtocolMessageClass_t messageClass;

  if ((ctx == NULL) || (frame == NULL))
  {
    return;
  }

  if (MmiProtocolV2CanIdToMessageClass(frame->standardId, &messageClass) == 0U)
  {
    return;
  }

  switch (messageClass)
  {
      case MMI_PROTOCOL_V2_MESSAGE_CLASS_HELLO_REQUEST:
      {
        MmiProtocolHelloRequestV2_t request;

        if (frame->length < sizeof(request))
        {
          return;
        }

        (void) memcpy(&request, &frame->data[0], sizeof(request));
        (void) QueueHelloResponse(ctx, &request);
        break;
      }

      case MMI_PROTOCOL_V2_MESSAGE_CLASS_COMMAND:
      {
        MmiProtocolSegmentV2_t segment;

        if (frame->length < sizeof(segment))
        {
          return;
        }

        (void) memcpy(&segment, &frame->data[0], sizeof(segment));
        ProcessCommandSegment(ctx, &segment);
        break;
      }

      case MMI_PROTOCOL_V2_MESSAGE_CLASS_SUBSCRIBE:
      {
        MmiProtocolSegmentV2_t segment;

        if (frame->length < sizeof(segment))
        {
          return;
        }

        (void) memcpy(&segment, &frame->data[0], sizeof(segment));
        if (ctx->sessionId == 0U)
        {
          ctx->sessionId = (segment.sessionId != 0U) ? segment.sessionId : 1U;
        }
        (void) QueueAck(ctx,
                        MMI_PROTOCOL_V2_MESSAGE_CLASS_SUBSCRIBE,
                        segment.transferId,
                        MMI_PROTOCOL_V2_STATUS_UNSUPPORTED);
        break;
      }

      default:
      {
        break;
      }
  }
}

void MmiCanAdapterInit(MmiCanAdapterCtx_t *ctx,
                       FDCAN_HandleTypeDef *hfdcan,
                       MmiService_t *service,
                       MmiSnapshotCache_t *snapshotCache)
{
  if (ctx == NULL)
  {
    return;
  }

  (void) memset(ctx, 0, sizeof(*ctx));
  ctx->hfdcan = hfdcan;
  ctx->service = service;
  ctx->snapshotCache = snapshotCache;
  ctx->eventLogService = NULL;
  ctx->localSettingsService = NULL;
  ctx->maintenanceService = NULL;
  if ((service != NULL) && (service->configurationService != NULL)
      && (service->intersectionEngine != NULL)
      && (service->intersectionController != NULL))
  {
    LWIPSNMPAdapterInit(&ctx->ntcipAdapter,
                        service->configurationService,
                        service->intersectionEngine,
                        service->intersectionController);
  }
  CreateOsObjects(ctx);
  ResetRxTransfer(ctx);
  s_registeredCtx = ctx;
}

void MmiCanAdapterBindActivationService(
  MmiCanAdapterCtx_t *ctx,
  IntersectionActivationService_t *activationService)
{
  if (ctx != NULL)
  {
    LWIPSNMPAdapterBindActivationService(&ctx->ntcipAdapter, activationService);
  }
}

void MmiCanAdapterBindDetectorReportService(
  MmiCanAdapterCtx_t *ctx,
  DetectorReportService_t *detectorReportService)
{
  if (ctx != NULL)
  {
    LWIPSNMPAdapterBindDetectorReportService(&ctx->ntcipAdapter,
                                            detectorReportService);
  }
}

void MmiCanAdapterBindGlobalTimeManagementService(
  MmiCanAdapterCtx_t *ctx,
  GlobalTimeManagementService_t *globalTimeManagementService)
{
  if (ctx != NULL)
  {
    LWIPSNMPAdapterBindGlobalTimeManagementService(&ctx->ntcipAdapter,
                                                   globalTimeManagementService);
  }
}

void MmiCanAdapterBindDoorSensorPort(MmiCanAdapterCtx_t *ctx,
                                     IDoorSensorPort_t *doorSensorPort)
{
  if (ctx != NULL)
  {
    LWIPSNMPAdapterBindDoorSensorPort(&ctx->ntcipAdapter, doorSensorPort);
  }
}

void MmiCanAdapterBindHeaterPort(MmiCanAdapterCtx_t *ctx,
                                 IHeaterPort_t *heaterPort)
{
  if (ctx != NULL)
  {
    LWIPSNMPAdapterBindHeaterPort(&ctx->ntcipAdapter, heaterPort);
  }
}

void MmiCanAdapterBindPowerMonitorPort(MmiCanAdapterCtx_t *ctx,
                                       IPowerMonitorPort_t *powerMonitorPort)
{
  if (ctx != NULL)
  {
    LWIPSNMPAdapterBindPowerMonitorPort(&ctx->ntcipAdapter, powerMonitorPort);
  }
}

void MmiCanAdapterBindUnitAlarmPort(MmiCanAdapterCtx_t *ctx,
                                    IUnitAlarmPort_t *unitAlarmPort)
{
  if (ctx != NULL)
  {
    LWIPSNMPAdapterBindUnitAlarmPort(&ctx->ntcipAdapter, unitAlarmPort);
  }
}

void MmiCanAdapterBindUnitClockPort(MmiCanAdapterCtx_t *ctx,
                                    IUnitClockPort_t *unitClockPort)
{
  if (ctx != NULL)
  {
    LWIPSNMPAdapterBindUnitClockPort(&ctx->ntcipAdapter, unitClockPort);
  }
}

