mehdinuri/CPU4v1/CPM/CP/App/Adapters/STM32/MmiCanAdapter.c
void MmiCanAdapterBindCpMpLinkService(MmiCanAdapterCtx_t *ctx,
                                      CpMpLinkService_t *cpMpLinkService)
{
  if (ctx != NULL)
  {
    LWIPSNMPAdapterBindCpMpLinkService(&ctx->ntcipAdapter, cpMpLinkService);
  }
}

void MmiCanAdapterBindLocalSettingsService(
  MmiCanAdapterCtx_t *ctx,
  MmiLocalSettingsService_t *localSettingsService)
{
  if (ctx != NULL)
  {
    ctx->localSettingsService = localSettingsService;
  }
}

void MmiCanAdapterBindEventLogService(MmiCanAdapterCtx_t *ctx,
                                      MmiEventLogService_t *eventLogService)
{
  if (ctx != NULL)
  {
    ctx->eventLogService = eventLogService;
  }
}

void MmiCanAdapterBindMaintenanceService(MmiCanAdapterCtx_t *ctx,
                                         MmiMaintenanceService_t *service)
{
  if (ctx != NULL)
  {
    ctx->maintenanceService = service;
  }
}

void MmiCanAdapterOnRxIsr(const FDCAN_RxHeaderTypeDef *header,
                          const uint8_t *data)
{
  MmiCanAdapterCtx_t *ctx = s_registeredCtx;
  uint8_t length;

  if ((ctx == NULL) || (header == NULL) || (data == NULL)
      || (header->IdType != FDCAN_STANDARD_ID))
  {
    return;
  }

  length = DlcToLength(header->DataLength);
  if (length > 8U)
  {
    length = 8U;
  }

  if (QueueFrame(ctx->rxPool,
                 ctx->rxQueue,
                 (uint16_t) header->Identifier,
                 data,
                 length) == 0U)
  {
    ctx->rxDrops++;
  }
}

void MmiCanAdapterStep(void)
{
  MmiCanAdapterCtx_t *ctx = s_registeredCtx;
  MmiQueuedFrame_t *queuedFrame;

  if (ctx == NULL)
  {
    return;
  }

  while ((ctx->rxQueue != NULL)
         && (osMessageQueueGet(ctx->rxQueue, &queuedFrame, NULL, 0U) == osOK))
  {
    ProcessRxFrame(ctx, queuedFrame);
    (void) osMemoryPoolFree(ctx->rxPool, queuedFrame);
  }

  while ((ctx->txQueue != NULL)
         && (osMessageQueueGet(ctx->txQueue, &queuedFrame, NULL, 0U) == osOK))
  {
    FDCAN_TxHeaderTypeDef header;

    (void) memset(&header, 0, sizeof(header));
    header.Identifier = queuedFrame->standardId;
    header.IdType = FDCAN_STANDARD_ID;
    header.TxFrameType = FDCAN_DATA_FRAME;
    header.DataLength = LengthToDlc(queuedFrame->length);
    header.ErrorStateIndicator = FDCAN_ESI_ACTIVE;
    header.BitRateSwitch = FDCAN_BRS_OFF;
    header.FDFormat = FDCAN_CLASSIC_CAN;
    header.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
    header.MessageMarker = 0U;

    if ((ctx->hfdcan == NULL)
        || (HAL_FDCAN_AddMessageToTxFifoQ(ctx->hfdcan,
                                          &header,
                                          &queuedFrame->data[0]) != HAL_OK))
    {
      if ((ctx->txQueue == NULL)
          || (osMessageQueuePut(ctx->txQueue, &queuedFrame, 0U, 0U) != osOK))
      {
        ctx->txErrors++;
        (void) osMemoryPoolFree(ctx->txPool, queuedFrame);
      }
      break;
    }

    (void) osMemoryPoolFree(ctx->txPool, queuedFrame);
  }
}
